{
  "00": {
    "title": "Basic Setup Requirement",
    "priority": "critical",
    "type": "requirement",
    "description": "**PREREQUISITE:** Before any tests can pass, the payroll system must be properly compiled and running.\n\nThe current situation with the payroll calculator is quite challenging. The payroll vendor responsible for managing and maintaining the payroll system has unexpectedly gone out of business, leaving their team unavailable for any support or assistance.\n\nThis sudden disruption has caused significant issues, as the payroll was pre-generated and distributed into checks by various departments. Unfortunately, these departments have started flagging numerous issues with the payroll calculations, indicating potential errors that need immediate attention.\n\n**Your first task:** Successfully compile and run the payroll calculator using the provided source code and input data files. This is essential before you can begin addressing the specific issues reported by the departments.\n\n**Note:** This is not a separate test case, but a fundamental requirement for all other tasks to function."
  },
  "01": {
    "title": "Missing Payroll Record",
    "priority": "urgent",
    "type": "email",
    "subject": "Urgent Payroll Issue for User ID 24778715",
    "description": "We are writing to formally raise a complaint regarding a critical payroll issue identified in the reconciliation report for the DB payroll department. It has come to our attention that there is no payroll record generated for a specific user.\n\nThis discrepancy, if not addressed immediately, will result in the user not receiving their due payment. The absence of a payroll record for this user is a matter of urgent concern. Failure to resolve this issue promptly could lead to a negative experience for the user and expose the organization to potential legal action.\n\n**Action Required:** Please investigate and rectify this issue as a matter of priority. We request immediate attention and resolution to ensure the user receives their payment without further delay."
  },
  "02": {
    "title": "Duplicate Salary Payment",
    "priority": "urgent",
    "type": "ticket",
    "ticket": "PRCALC-18556",
    "description": "**Employee received his salary twice.**\n\nAn employee received his salary twice for one month. Please urgently check why it happened and fix the issue.\n\nOur operation team has fixed it and the duplicated transaction was cancelled, but we don't want this to happen again.\n\nThis indicates there's a bug in the payroll system that's causing duplicate payments to be generated for certain employees. The system should ensure each employee receives exactly one payment per period."
  },
  "03": {
    "title": "Missing Overtime Payment",
    "priority": "normal",
    "type": "email",
    "subject": "Overtime for Previous Month",
    "sender": "Franz Josef Hartmann",
    "description": "Dear Payroll Calculator Support Team,\n\nI hope this message finds you well.\n\nI am writing to bring to your attention an issue regarding my overtime payment for the month of April. Despite having logged the overtime hours as required, I have not received the corresponding payment.\n\nCould you please investigate this matter and ensure that the payment is processed at the earliest convenience? I have attached the relevant timesheets for your reference.\n\nThank you for your prompt attention to this matter. I look forward to your swift resolution.\n\nBest regards,\nFranz Josef Hartmann"
  },
  "04": {
    "title": "Tax Class Handling Implementation",
    "priority": "normal",
    "type": "ticket",
    "ticket": "PRCALC-17359",
    "subject": "Add Support for Tax Class Handling in Payroll Calculations",
    "description": "As part of enhancing the Payroll Calculator, we need to introduce support for handling employee tax classes. The tax class should influence the calculation of payroll deductions and net salary. This change ensures better accuracy and compliance with German payroll requirements.",
    "details": {
      "taxClasses": [
        {
          "class": "1",
          "description": "Single, not in a partnership",
          "rate": "20%"
        },
        {
          "class": "3",
          "description": "Married, higher earner",
          "rate": "10%"
        },
        {
          "class": "4",
          "description": "Married, both earn similar",
          "rate": "15%"
        }
      ],
      "scope": [
        "Accept tax class as input per employee",
        "Map tax class to corresponding tax rate",
        "Apply rate during payroll calculations to determine tax deductions",
        "Ensure compatibility with existing calculations and outputs"
      ]
    }
  },
  "05": {
    "title": "Fix Salary Proration Based on Working Days",
    "priority": "normal",
    "type": "ticket",
    "ticket": "PRCALC-27919",
    "subject": "Fix Payroll Calculation to Accurately Prorate Based on Days Worked per Month",
    "description": "The current implementation of the Payroll Calculator does not properly account for the number of days worked in relation to the total number of working days in a given month. This leads to incorrect salary proration, especially in cases where employees join, leave, or take unpaid leave during the month.\n\nThese discrepancies frequently result in complaints from employees, which have to be manually investigated and corrected by payroll staff. This not only consumes significant administrative time but also negatively impacts employee trust and satisfaction with the payroll process.\n\nAddressing this issue will ensure that the calculator determines the correct number of working days in each month (excluding weekends and public holidays where applicable) and uses this to prorate salary and deductions accurately.\n\n**Expected Impact:** Fixing this would reduce the number of manual corrections required, saving approximately 15 minutes per case. With an estimated 30–40 such cases per payroll cycle, this change could save up to 10 hours per month for the payroll team. More importantly, it would also save employees time and frustration, helping maintain trust and morale by ensuring their compensation is calculated fairly the first time."
  },
  "06": {
    "title": "Remove Terminated Employee",
    "priority": "urgent",
    "type": "ticket",
    "ticket": "PRCALC-11663",
    "subject": "Persons who already are not working with us got salary",
    "description": "The salary calculator prepared the salary transaction for individuals who are not working with us anymore. Please, check and fix the issue.\n\n**Example:** Former employee still receiving payments\n\nThis indicates that the payroll system is not properly filtering out terminated employees from payroll processing. The system should only process payments for currently active employees."
  },
  "07": {
    "title": "Incorrect Overtime Calculation",
    "priority": "urgent",
    "type": "email",
    "subject": "12 hours overtime didn't get what expected",
    "sender": "Juergen Trub",
    "description": "Dear Payroll Calculator Support team,\n\nI hope this message finds you well. My name is Juergen Trub, and I am writing to bring to your attention a discrepancy in my recent billing statement regarding overtime payments.\n\nOn May 5th, I worked an additional **12 hours** due to an incident in production. However, upon reviewing my current billing statement, I noticed that the overtime payments are less than expected. This discrepancy is causing me significant concern and frustration.\n\nI kindly request that you recalculate my payment for the overtime hours worked and rectify this issue as soon as possible. Please provide me with an updated statement reflecting the correct amount.\n\nThank you for your prompt attention to this matter.\n\nBest regards,\nLudwina Gerlach"
  },
  "08": {
    "title": "Missing Overtime Payments - Multiple Employees",
    "priority": "urgent",
    "type": "ticket",
    "ticket": "PRCALC-12334",
    "subject": "Missing Overtime Payment",
    "description": "Multiple employees have reported missing overtime payments from their salary calculations.",
    "emails": [
      {
        "sender": "Miss Schenk",
        "subject": "Assistance Required with Overtime Payment for Last Month",
        "content": "Dear Tech Support Team,\n\nI hope this message finds you well.\n\nI am writing to seek your assistance regarding an issue with my salary payment for last month. Upon reviewing the amount credited to my account, I noticed that it only reflects my base salary and does not include the overtime payment I am entitled to.\n\nCould you please look into this matter and help ensure that the overtime payment is processed correctly? Your attention to this issue would be greatly appreciated.\n\nThank you for your support.\n\nBest regards,\nMiss Schenk"
      },
      {
        "sender": "Mr. Graf",
        "subject": "Immediate Action Required: Missing Overtime Payment",
        "content": "Hi Tech Support Team,\n\nI'm really frustrated right now. My salary for last month only includes my base pay and is missing the overtime I worked hard for. This is unacceptable, especially since I have a mortgage payment due in a few days.\n\nI need this fixed immediately. Please process my overtime payment ASAP. This is urgent and can't wait.\n\nThanks,\nMr. Graf"
      }
    ]
  },
  "09": {
    "title": "Missing Salary",
    "priority": "urgent",
    "type": "support_note",
    "employee": "Joseph Stahr",
    "department": "Legal and Compliance",
    "issue": "Missing salary in account",
    "description": "I am extremely upset and disappointed to find that my salary is missing from my account this month. This situation has caused me significant harm and stress. I depend on my salary to cover essential expenses, and this oversight has left me in a precarious financial position.\n\nI have bills to pay, and this delay has already resulted in late fees and penalties. The anxiety and frustration this has caused me are overwhelming, and I need this issue resolved immediately.\n\nThe harm caused by this negligence is both financial and emotional. As a dedicated employee, I expect my salary to be deposited on time. The lack of communication and urgency in addressing this issue is unacceptable.\n\n**Demands:** I demand that my salary be deposited into my account without any further delay, and I expect a formal apology for the distress and inconvenience caused. If this issue is not resolved promptly, I will be forced to take further action."
  },
  "10": {
    "title": "Queen",
    "priority": "urgent",
    "type": "support_note",
    "employee": "Joseph Stahr",
    "department": "Legal and Compliance",
    "issue": "Missing salary in account",
    "description": "I am extremely upset and disappointed to find that my salary is missing from my account this month. This situation has caused me significant harm and stress. I depend on my salary to cover essential expenses, and this oversight has left me in a precarious financial position.\n\nI have bills to pay, and this delay has already resulted in late fees and penalties. The anxiety and frustration this has caused me are overwhelming, and I need this issue resolved immediately.\n\nThe harm caused by this negligence is both financial and emotional. As a dedicated employee, I expect my salary to be deposited on time. The lack of communication and urgency in addressing this issue is unacceptable.\n\n**Demands:** I demand that my salary be deposited into my account without any further delay, and I expect a formal apology for the distress and inconvenience caused. If this issue is not resolved promptly, I will be forced to take further action."
  },
  "11": {
    "title": "Report",
    "priority": "urgent",
    "type": "support_note",
    "employee": "Joseph Stahr",
    "department": "Legal and Compliance",
    "issue": "Missing salary in account",
    "description": "I am extremely upset and disappointed to find that my salary is missing from my account this month. This situation has caused me significant harm and stress. I depend on my salary to cover essential expenses, and this oversight has left me in a precarious financial position.\n\nI have bills to pay, and this delay has already resulted in late fees and penalties. The anxiety and frustration this has caused me are overwhelming, and I need this issue resolved immediately.\n\nThe harm caused by this negligence is both financial and emotional. As a dedicated employee, I expect my salary to be deposited on time. The lack of communication and urgency in addressing this issue is unacceptable.\n\n**Demands:** I demand that my salary be deposited into my account without any further delay, and I expect a formal apology for the distress and inconvenience caused. If this issue is not resolved promptly, I will be forced to take further action."
  }
}